
[
  {
    "_class": "com.ti.avaliai.university.University",
    "@id": 1,
    "hashId": "543b45c583bfff6c30e44a751103a24f",
    "name": "PUC Minas",
    "cnpj": "17.178.195/0001-67",
    "courses": [
      {
        "id":1
      }
    ],
    "isDeleted": false
  },
  {
    "_class": "com.ti.avaliai.course.Course",
    "@id": 1,
    "hashId": "1f061de68a7a0da8378fd30974dd1a98",
    "name": "Engenharia de Software",
    "overtime": 10,
    "subjects": [
      { "id": 1 },
      { "id": 2 },
      { "id": 3 },
      { "id": 4 },
      { "id": 5 },
      { "id": 6 },
      { "id": 7 },
      { "id": 8 },
      { "id": 9 },
      { "id": 10 },
      { "id": 11 },
      { "id": 12 },
      { "id": 13 },
      { "id": 14 },
      { "id": 15 },
      { "id": 16 },
      { "id": 17 },
      { "id": 18 },
      { "id": 19 },
      { "id": 20 },
      { "id": 21 },
      { "id": 22 },
      { "id": 23 },
      { "id": 24 },
      { "id": 25 },
      { "id": 26 },
      { "id": 27 },
      { "id": 28 },
      { "id": 29 },
      { "id": 30 },
      { "id": 31 },
      { "id": 32 },
      { "id": 33 },
      { "id": 34 },
      { "id": 35 },
      { "id": 36 },
      { "id": 37 },
      { "id": 38 },
      { "id": 39 },
      { "id": 40 },
      { "id": 41 },
      { "id": 42 },
      { "id": 43 },
      { "id": 44 },
      { "id": 45 },
      { "id": 46 },
      { "id": 47 }
    ],
    "statusCurriculum": true,
    "isDeleted": false,
    "university": {
      "id": 1
    }
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 1,
    "hashId": "46b4a35d3d2b2b46b22260317dfebabb",
    "name": "Algoritmos e Estruturas de Dados I",
    "imageUrl": "https://acadtec.com.br/storage/posts/pictures/xvJ3NLSKUF4wMqwHrZTe582480234f6a8.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "Algoritmos e Estruturas de Dados I é uma disciplina essencial no curso de Engenharia de Software, abordando conceitos teóricos e práticos relacionados à organização e manipulação eficiente de dados. Os estudantes aprenderão a projetar algoritmos eficientes, selecionar as estruturas de dados adequadas e analisar o desempenho dos algoritmos. Essas habilidades são fundamentais para o desenvolvimento de software de alta qualidade e desempenho.",
    "longDescription": "A disciplina de Algoritmos e Estruturas de Dados I é um componente essencial do curso de Engenharia de Software, projetado para fornecer aos estudantes uma base sólida na teoria e prática dos algoritmos e estruturas de dados. Durante o curso, os alunos explorarão uma ampla gama de conceitos fundamentais relacionados à organização, manipulação e armazenamento eficiente de dados.\n\nA disciplina inicia-se com uma introdução aos principais conceitos de análise de algoritmos, permitindo que os estudantes compreendam como avaliar a eficiência e a complexidade de diferentes abordagens algorítmicas. Em seguida, são apresentadas diversas estruturas de dados, como arrays, listas, pilhas, filas, árvores e grafos, bem como técnicas de pesquisa e ordenação.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 2,
    "hashId": "bbf5f7f3f3cbceb99ab38c29e0e4a6f7",
    "name": "Algoritmos e Estruturas de Dados II",
    "imageUrl": "https://rhpravoce.com.br/wp-content/uploads/2021/12/Demissao-por-algoritmos-1.png",
    "campus": "Praça da Liberdade",
    "shortDescription": "Algoritmos e Estruturas de Dados II é uma disciplina avançada que aprofunda o conhecimento em algoritmos e estruturas de dados. Os estudantes exploram estruturas complexas, como árvores avançadas e tabelas hash, além de técnicas avançadas de busca e ordenação. Eles também aprendem a analisar e otimizar o desempenho dos algoritmos, abordando tópicos como algoritmos de grafos, programação dinâmica e algoritmos probabilísticos. Essa disciplina prepara os estudantes para enfrentar desafios complexos no desenvolvimento de software e dominar técnicas avançadas de solução de problemas.",
    "longDescription": "Algoritmos e Estruturas de Dados II é uma disciplina avançada e complementar do curso de Engenharia de Software, que aprofunda o conhecimento adquirido na disciplina anterior. Neste curso, os estudantes exploram conceitos mais complexos e sofisticados relacionados aos algoritmos e às estruturas de dados, capacitando-os a resolver problemas computacionais de forma eficiente e escalável.\n\nA disciplina começa com uma revisão dos principais tópicos abordados em Algoritmos e Estruturas de Dados I, a fim de consolidar os fundamentos e garantir uma base sólida para o desenvolvimento das habilidades avançadas. Em seguida, os alunos são introduzidos a novas estruturas de dados, como árvores avançadas (AVL, B, rubro-negras), tabelas hash, heaps e grafos ponderados. Eles também exploram algoritmos de busca e ordenação mais sofisticados, como busca em largura e profundidade, ordenação rápida, merge sort e heapsort.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 3,
    "hashId": "07d1914ac9d8f0b2a1099f124d92c54e",
    "name": "Fundamentos de Engenharia de Software",
    "imageUrl": "https://www.forbes.com/advisor/wp-content/uploads/2022/06/software_engineer.jpeg.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de \"Fundamentos de Engenharia de Software\" é uma parte essencial do curso de Engenharia de Software, que abrange os conceitos básicos e fundamentais da engenharia de software. Durante essa disciplina, os estudantes serão introduzidos aos princípios, métodos e técnicas necessárias para o desenvolvimento de software de qualidade. Eles irão explorar tópicos como ciclo de vida de desenvolvimento de software, processos de engenharia de requisitos, modelagem de software, teste de software, gerenciamento de configuração e qualidade de software. Essa disciplina fornecerá uma base sólida para os futuros engenheiros de software, preparando-os para abordar projetos de desenvolvimento de software de maneira eficiente e profissional.",
    "longDescription": "A disciplina de \"Fundamentos de Engenharia de Software\" é uma parte crucial do currículo do curso de Engenharia de Software, que oferece aos estudantes uma visão abrangente dos conceitos essenciais e dos processos fundamentais envolvidos no desenvolvimento de software. Ao longo dessa disciplina, os alunos explorarão o ciclo de vida do desenvolvimento de software, desde a elicitação e análise de requisitos até a implantação e manutenção do software. Eles aprenderão sobre diferentes processos de engenharia de requisitos, técnicas de modelagem de software, métodos de teste de software e técnicas de gerenciamento de configuração e qualidade de software.\n\nEssa disciplina também enfatiza a importância de práticas de engenharia de software eficazes, como o uso de metodologias ágeis, engenharia de software baseada em componentes e gerenciamento de projetos. Os alunos terão a oportunidade de aplicar esses conceitos em projetos práticos, colaborando em equipes para desenvolver soluções de software realistas. Ao concluir a disciplina, os estudantes estarão familiarizados com os principais fundamentos da engenharia de software e terão adquirido as habilidades necessárias para planejar, desenvolver e entregar projetos de software de qualidade, cumprindo prazos e requisitos específicos.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 4,
    "hashId": "f25e46b2ebe1b297f658df2a4f5ca63c",
    "name": "Desenvolvimento de Interfaces Web",
    "imageUrl": "https://e0.pxfuel.com/wallpapers/281/866/desktop-wallpaper-web-designer-website-design.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Desenvolvimento de Interfaces Web abrange os princípios e práticas para criação de interfaces interativas e atraentes para aplicações web. Os alunos aprenderão técnicas de design responsivo, usabilidade, acessibilidade e programação front-end, capacitando-os a desenvolver interfaces web modernas e eficientes.",
    "longDescription": "A disciplina de Desenvolvimento de Interfaces Web é essencial para o curso de Engenharia de Software, fornecendo aos estudantes os conhecimentos e habilidades necessários para criar interfaces interativas e atraentes para aplicações web. Os alunos irão explorar os princípios do design responsivo, que visam adaptar a interface aos diferentes dispositivos e tamanhos de tela, garantindo uma experiência consistente para os usuários. Durante a disciplina, serão abordadas técnicas de usabilidade e acessibilidade, enfatizando a importância de uma interface intuitiva, fácil de usar e acessível para todos os usuários, incluindo pessoas com deficiência. Os alunos aprenderão a criar layouts eficientes, com hierarquia visual clara e navegação intuitiva, a fim de melhorar a experiência do usuário.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 5,
    "hashId": "a0e4a3da1e3bfbf69910059f4e17d8d9",
    "name": "Trabalho Interdisciplinar V",
    "imageUrl": "https://miro.medium.com/v2/resize:fit:800/1*rWCq1Fu5O0BfuliuDtNRaw.jpeg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Trabalho Interdisciplinar V tem como objetivo proporcionar aos alunos a oportunidade de aplicar os conhecimentos adquiridos ao longo do curso de Engenharia de Software em projetos práticos. Os estudantes irão trabalhar em equipes, enfrentando desafios reais e desenvolvendo soluções inovadoras.",
    "longDescription": "A disciplina de Trabalho Interdisciplinar V é uma etapa fundamental do curso de Engenharia de Software, em que os alunos têm a oportunidade de aplicar os conhecimentos teóricos e práticos adquiridos ao longo do curso em projetos reais. Nessa disciplina, os estudantes trabalharão em equipes multidisciplinares, enfrentando desafios complexos e desenvolvendo soluções inovadoras para problemas do mundo real. O foco principal do Trabalho Interdisciplinar V é a integração de conhecimentos de diferentes disciplinas, como programação, banco de dados, engenharia de software, entre outras. Os alunos terão a oportunidade de aplicar conceitos e técnicas aprendidas em disciplinas anteriores, colaborando com colegas de diferentes áreas de expertise para a realização de projetos práticos.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 6,
    "hashId": "ff4b5a68598b3eb2b86fbbe9a574c211",
    "name": "Banco de Dados",
    "imageUrl": "https://media.istockphoto.com/id/1399944678/photo/multiple-database-is-placed-on-relational-database-tables-with-server-room-and-datacenter.webp?b=1&s=170667a&w=0&k=20&c=Ii0Wn4lommSX7q2U237SsZVYdMiE6XDzfr2-_oli97w=",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Banco de Dados aborda os conceitos e técnicas relacionados à criação, manipulação e gerenciamento de bancos de dados. Os alunos aprenderão sobre modelagem de dados, linguagens de consulta, projetos de banco de dados e otimização de desempenho.",
    "longDescription": "A disciplina de Banco de Dados é fundamental para o curso de Engenharia de Software, pois fornece aos alunos os conhecimentos e habilidades necessários para lidar com a criação, manipulação e gerenciamento de bancos de dados. Os estudantes aprenderão os conceitos fundamentais de banco de dados, como modelagem de dados, normalização, integridade e segurança. Durante a disciplina, os alunos terão a oportunidade de explorar diferentes linguagens de consulta, como SQL, para realizar operações de seleção, inserção, atualização e exclusão de dados. Eles aprenderão a projetar e implementar esquemas de banco de dados eficientes, levando em consideração as necessidades dos sistemas e as restrições impostas pelo ambiente de negócio.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 7,
    "hashId": "b85bcaee7935a9d95b4681bcb058a106",
    "name": "Projeto de Software",
    "imageUrl": "https://canadianbusinesscollege.com/wp-content/uploads/2020/09/Aug-21-software-engineering-program-opt.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Projeto de Software aborda os princípios, técnicas e metodologias para a concepção e desenvolvimento de sistemas de software, preparando os estudantes para lidar com a complexidade do desenvolvimento de sistemas de grande porte.",
    "longDescription": "A disciplina de Projeto de Software tem como objetivo fornecer aos estudantes os conhecimentos teóricos e práticos necessários para conceber e desenvolver sistemas de software de alta qualidade. Os alunos serão introduzidos aos princípios e técnicas de análise e design de software, aprendendo a identificar requisitos, criar modelos de design, escolher arquiteturas adequadas e planejar a implementação do projeto. Serão explorados diferentes modelos de processos de desenvolvimento, como o modelo em cascata, o modelo iterativo e incremental, e o modelo ágil, permitindo que os alunos compreendam as vantagens e desafios de cada abordagem. Além disso, serão abordadas boas práticas de documentação, testes e gerenciamento de projetos, visando a entrega de software de qualidade dentro dos prazos e recursos estabelecidos. Durante o curso, os alunos terão a oportunidade de aplicar os conhecimentos teóricos em projetos práticos, trabalhando em equipes multidisciplinares para desenvolver soluções reais. Serão utilizadas ferramentas e técnicas de design e modelagem, como diagramas UML, para representar as diferentes perspectivas do sistema. Também serão discutidos aspectos relacionados à qualidade do software, como testes automatizados, revisões de código e padrões de projeto. Ao final da disciplina, os alunos estarão aptos a conceber e desenvolver sistemas de software robustos, eficientes e escaláveis, seguindo boas práticas da engenharia de software.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 8,
    "hashId": "9bf31c7ff062936a96d3c8bd1f8f2ff3",
    "name": "Engenharia de Requisitos",
    "imageUrl": "https://e0.pxfuel.com/wallpapers/160/257/desktop-wallpaper-best-artificial-intelligence-software-development-company-for-your-mobile-tablet-explore-machine-learning-machine-learning-machine-machine-human-machine.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Engenharia de Requisitos aborda os processos, técnicas e práticas para elicitar, analisar, documentar e gerenciar os requisitos de um sistema de software, visando garantir que as necessidades dos usuários sejam atendidas de forma eficiente e eficaz.",
    "longDescription": "A disciplina de Engenharia de Requisitos tem como objetivo fornecer aos estudantes os conhecimentos e habilidades necessários para identificar, analisar, documentar e gerenciar os requisitos de um sistema de software. Serão abordados os processos e atividades envolvidos na engenharia de requisitos, incluindo a elicitação de requisitos, a análise e negociação de requisitos, a documentação de requisitos e o gerenciamento de mudanças. Os alunos aprenderão técnicas e práticas para coletar informações dos stakeholders, identificar necessidades e restrições, e definir os requisitos funcionais e não funcionais do sistema. Serão exploradas metodologias e ferramentas para modelagem e especificação de requisitos, como diagramas de caso de uso, prototipagem e escrita de user stories. Além disso, serão discutidos aspectos relacionados à validação e verificação de requisitos, garantindo que os requisitos estejam corretos, completos e consistentes. A disciplina também abordará a comunicação e colaboração com os stakeholders, visando estabelecer uma compreensão compartilhada dos requisitos e promover um processo de desenvolvimento mais eficiente e eficaz. Ao final da disciplina, os alunos estarão aptos a aplicar os princípios e práticas da engenharia de requisitos em projetos de software, garantindo que as necessidades dos usuários sejam atendidas de forma adequada e que o sistema desenvolvido seja de alta qualidade.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 9,
    "hashId": "d8da0c383033c9de51017aef7bfe520d",
    "name": "Programação Modular",
    "imageUrl": "https://www.uml-diagrams.org/examples/class-diagram-example-hasp-licensing-domain.png",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Programação Modular aborda a técnica de dividir um programa em módulos independentes e reutilizáveis. Os alunos aprenderão a criar interfaces claras e coesas entre os módulos, permitindo uma melhor organização e manutenção do código. Eles também explorarão conceitos como encapsulamento, coesão e acoplamento, fundamentais para o desenvolvimento de software modularizado.",
    "longDescription": "A disciplina de Programação Modular tem como objetivo fornecer aos alunos uma compreensão aprofundada dos princípios e práticas envolvidos no desenvolvimento de software modular. Os estudantes aprenderão a decompor um programa em módulos independentes, que podem ser desenvolvidos e testados separadamente. Eles explorarão técnicas de design de interfaces, visando a criação de módulos com baixo acoplamento e alta coesão. Além disso, os alunos serão apresentados a padrões de projeto que promovem a modularidade, como o padrão de projeto Observer ou o padrão de Injeção de Dependência. Ao final do curso, os estudantes estarão aptos a aplicar os princípios da programação modular em seus projetos, resultando em um código mais organizado, reutilizável e de fácil manutenção."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 10,
    "hashId": "d3d9446802a44259755d38e6d163e820",
    "name": "Laboratório de Programação Modular",
    "imageUrl": "https://novonegocio.com.br/wp-content/uploads/2011/01/Como-Montar-Uma-Lan-House.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Laboratório de Programação Modular oferece aos alunos a oportunidade de aplicar os conceitos e técnicas aprendidos na disciplina de Programação Modular em projetos práticos. Os estudantes trabalharão em equipe para desenvolver soluções de software modularizadas, aplicando boas práticas de design e implementação. Eles também terão a chance de aprimorar suas habilidades de trabalho em equipe, colaboração e resolução de problemas.",
    "longDescription": "A disciplina de Laboratório de Programação Modular é uma extensão da disciplina de Programação Modular, na qual os alunos têm a oportunidade de colocar em prática os conceitos e técnicas aprendidos. Durante o laboratório, os estudantes trabalharão em equipes multidisciplinares, simulando um ambiente de desenvolvimento real. Eles aplicarão metodologias ágeis, como Scrum ou Kanban, para planejar, desenvolver e entregar os projetos dentro de prazos e requisitos definidos. Além disso, os alunos aprenderão a colaborar efetivamente em equipe, utilizando ferramentas de controle de versão, realizando revisões de código e gerenciando conflitos. O laboratório proporcionará uma experiência prática valiosa, permitindo que os estudantes adquiram habilidades técnicas e não técnicas essenciais para o sucesso na indústria de desenvolvimento de software."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 11,
    "hashId": "6512bd43d9caa6e02c990b0a82652dca",
    "name": "Laboratório de Desenvolvimento de Software",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Contemporary_Computer_Lab.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Laboratório de Desenvolvimento de Software proporciona aos alunos a oportunidade de aplicar os conhecimentos adquiridos nas disciplinas teóricas em projetos práticos de desenvolvimento de software. Os estudantes trabalharão em equipe para criar soluções completas, seguindo as etapas do ciclo de vida do desenvolvimento de software e utilizando metodologias ágeis.",
    "longDescription": "A disciplina de Laboratório de Desenvolvimento de Software tem como objetivo proporcionar aos alunos uma experiência prática no desenvolvimento de software, aplicando os conceitos e técnicas aprendidos em disciplinas teóricas. Durante o laboratório, os estudantes trabalharão em equipes multidisciplinares para desenvolver soluções de software completas, desde a concepção até a entrega final. Eles seguirão as etapas do ciclo de vida do desenvolvimento de software, incluindo análise de requisitos, design, implementação, testes e implantação. Além disso, os alunos utilizarão metodologias ágeis, como Scrum ou Kanban, para gerenciar o projeto de forma iterativa e colaborativa. O laboratório permitirá que os estudantes apliquem seu conhecimento em um ambiente prático, enfrentando desafios reais e adquirindo habilidades valiosas para a indústria de desenvolvimento de software.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 12,
    "hashId": "4b43b0aee35624cd95b910189b3dc231",
    "name": "Testes de Software",
    "imageUrl": "https://png.pngtree.com/thumb_back/fh260/background/20220427/pngtree-tiny-business-people-with-digital-devices-testing-demo-software-image_1091430.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Testes de Software aborda as técnicas e práticas utilizadas para verificar e validar a qualidade de software. Os alunos aprenderão a projetar e executar testes eficientes, identificar e relatar defeitos, e entender a importância dos testes no ciclo de vida do desenvolvimento de software.",
    "longDescription": "A disciplina de Testes de Software tem como objetivo fornecer aos alunos uma compreensão aprofundada dos conceitos e técnicas relacionados aos testes de software. Os estudantes aprenderão a planejar, projetar e executar diferentes tipos de testes, como testes unitários, testes de integração, testes de sistema e testes de aceitação. Eles explorarão metodologias de teste, ferramentas e técnicas para identificar e relatar defeitos de forma eficiente. Além disso, os alunos entenderão a importância dos testes no ciclo de vida do desenvolvimento de software, incluindo a integração contínua e a prática de DevOps. Ao final do curso, os estudantes estarão aptos a garantir a qualidade e confiabilidade de software por meio de uma abordagem sistemática de testes."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 13,
    "hashId": "0b374d6378a204f977ef5953c93a1f2b",
    "name": "Arquitetura de Software",
    "imageUrl": "https://media.istockphoto.com/id/1330669820/vector/smart-house-system-programming-software-engineering-development-of-building-construction.jpg?s=612x612&w=0&k=20&c=qGcNZYm9jccT9Zixp9IcCozURFufzE1HeWrrLvvO2XU=",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Arquitetura de Software aborda os princípios, conceitos e práticas envolvidos na criação de arquiteturas de software escaláveis e robustas. Os alunos aprenderão a projetar e comunicar a estrutura do sistema, considerando requisitos funcionais e não funcionais, padrões de design e melhores práticas da indústria.",
    "longDescription": "A disciplina de Arquitetura de Software tem como objetivo proporcionar aos alunos uma compreensão aprofundada dos fundamentos da arquitetura de software. Os estudantes aprenderão os princípios e conceitos chave para a criação de arquiteturas eficientes e escaláveis, levando em consideração requisitos funcionais e não funcionais. Eles explorarão padrões de design arquitetural, como arquitetura em camadas, arquitetura cliente-servidor, arquitetura orientada a serviços, entre outros. Além disso, os alunos aprenderão a comunicar e documentar a arquitetura do sistema por meio de diagramas e modelos apropriados. Ao final do curso, os estudantes estarão preparados para projetar arquiteturas de software que atendam às necessidades de escalabilidade, desempenho, segurança e manutenibilidade."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 14,
    "hashId": "e95ae57fc14b4db3bdc3b06241f23d97",
    "name": "Modelagem de Processos de Negócios",
    "imageUrl": "https://d1ltgr77xghfz9.cloudfront.net/wp-content/uploads/sites/2/2016/07/software-de-modelagem-de-processos-gratuito-1024x688.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Modelagem de Processos de Negócios ensina aos alunos técnicas e ferramentas para analisar, projetar e otimizar processos de negócios. Os estudantes aprenderão a mapear fluxos de trabalho, identificar gargalos e propor melhorias para aumentar a eficiência e eficácia das operações empresariais.",
    "longDescription": "A disciplina de Modelagem de Processos de Negócios tem como objetivo capacitar os alunos a compreender, analisar e otimizar processos de negócios em organizações. Os estudantes aprenderão a mapear fluxos de trabalho utilizando notações e técnicas específicas, como BPMN (Business Process Model and Notation) e UML (Unified Modeling Language). Eles explorarão abordagens para identificar gargalos, ineficiências e oportunidades de melhoria nos processos existentes. Além disso, os alunos aprenderão a propor soluções e estratégias para otimizar a eficiência e eficácia das operações empresariais. A disciplina abordará também a integração da modelagem de processos com a implementação de sistemas de informação, proporcionando aos estudantes uma visão abrangente do ciclo de vida de projetos de melhoria de processos."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 15,
    "hashId": "9f9d51bc70ef21ca5c14f307980a29d8",
    "name": "Cálculo I",
    "imageUrl": "https://media.istockphoto.com/id/1061714240/pt/foto/mathematics-lesson-differential-and-integral-calculus-chalkboard.jpg?s=2048x2048&w=is&k=20&c=k7_IHNcoDkRnfQkMU10gbKhE4NuN-W1QJCELTVywGZg=",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Cálculo I introduz os fundamentos do cálculo diferencial e integral. Os alunos aprenderão conceitos como limites, derivadas e integrais, e aplicarão esses conhecimentos para resolver problemas de taxa de variação, otimização e área sob a curva.",
    "longDescription": "A disciplina de Cálculo I tem como objetivo introduzir os alunos aos conceitos fundamentais do cálculo diferencial e integral. Os estudantes explorarão os limites, a continuidade e a diferenciação de funções, aprendendo a calcular derivadas e interpretar sua significância geométrica e física. Além disso, os alunos serão apresentados às técnicas básicas de integração e às aplicações do cálculo na resolução de problemas do mundo real. A disciplina abordará tópicos como taxa de variação, otimização de funções, análise de curvas e cálculo da área sob a curva. Ao final do curso, os estudantes estarão familiarizados com as ferramentas e métodos do cálculo diferencial e integral, preparando-os para disciplinas mais avançadas nas áreas de ciências exatas e engenharia."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 16,
    "hashId": "addb1d60eb10695e5f0ccad9fd0a552a",
    "name": "Cálculo II",
    "imageUrl": "https://i.pinimg.com/736x/bc/4d/0b/bc4d0b81cdb7ca11301e9c32b0149673.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Cálculo II dá continuidade ao estudo do cálculo diferencial e integral. Os alunos aprofundarão seus conhecimentos sobre integração, sequências e séries, e aprenderão técnicas avançadas para resolver problemas mais complexos.",
    "longDescription": "A disciplina de Cálculo II tem como objetivo aprofundar os conhecimentos dos alunos sobre o cálculo diferencial e integral. Os estudantes explorarão técnicas avançadas de integração, como integração por partes, substituição trigonométrica e frações parciais. Além disso, eles aprenderão sobre sequências e séries, incluindo séries de potências, séries geométricas e séries de Taylor. A disciplina abordará aplicações do cálculo em problemas de física, economia e engenharia, permitindo que os estudantes vejam a relevância e o poder do cálculo em diversas áreas. Ao final do curso, os alunos estarão preparados para enfrentar desafios mais complexos que envolvam o uso do cálculo diferencial e integral, bem como para prosseguir com estudos mais avançados na área de matemática e disciplinas relacionadas."
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 17,
    "hashId": "204c78e2767973d6812b5290921701a8",
    "name": "Cultura Religiosa: Fenômeno Religioso",
    "imageUrl": "https://png.pngtree.com/thumb_back/fh260/background/20210903/pngtree-chinese-style-religious-culture-national-tide-ancient-style-banner-background-image_793408.jpg",
    "campus": "Praça da Liberdade",
    "shortDescription": "A disciplina de Cultura Religiosa é uma área de estudo que se dedica a compreender e analisar o fenômeno religioso em suas diversas manifestações ao redor do mundo. ",
    "longDescription": " A disciplina de Cultura Religiosa é uma área de estudo que se dedica a compreender e analisar o fenômeno religioso em suas diversas manifestações ao redor do mundo. O fenômeno religioso é uma dimensão essencial da experiência humana, presente desde os primórdios da história da humanidade, e continua a desempenhar um papel significativo nas sociedades contemporâneas. O estudo da Cultura Religiosa abrange uma ampla gama de tópicos, incluindo crenças, práticas, rituais, mitos, símbolos, ética, valores e instituições religiosas. A disciplina busca explorar as diferentes religiões existentes, como o Cristianismo, o Islamismo, o Hinduísmo, o Budismo, o Judaísmo, entre muitas outras, bem como suas variantes e ramificações regionais.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 18,
    "hashId": "6122fae0889de17ddec71cc3ac7f3e62",
    "name": "Introdução à pesquisa em informática",
    "imageUrl": "https://images.unsplash.com/photo-1501290741922-b56c0d0884af?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8cmVzZWFyY2h8ZW58MHx8MHx8fDA%3D&w=1000&q=80",
    "campus": "Praça da Liberdade",
    "shortDescription": " A disciplina de Introdução à Pesquisa em Informática é uma área de estudo que visa fornecer aos estudantes uma compreensão sólida dos princípios, metodologias e técnicas envolvidas na condução de pesquisas científicas no campo da Informática ",
    "longDescription": " A disciplina de Introdução à Pesquisa em Informática é uma área de estudo que visa fornecer aos estudantes uma compreensão sólida dos princípios, metodologias e técnicas envolvidas na condução de pesquisas científicas no campo da Informática. Ela serve como uma introdução aos fundamentos da pesquisa, preparando os alunos para se envolverem em estudos mais avançados e aplicarem esses conhecimentos em suas carreiras acadêmicas ou profissionais. A disciplina aborda uma variedade de tópicos essenciais para a pesquisa em Informática, como a formulação de perguntas de pesquisa relevantes, o levantamento e revisão da literatura existente, a definição de objetivos claros de pesquisa, a escolha de métodos adequados para coleta e análise de dados, a elaboração de hipóteses e a avaliação de resultados. Uma parte fundamental do curso é o estudo das diferentes abordagens de pesquisa em Informática, como pesquisa experimental, pesquisa teórica, pesquisa de campo, pesquisa de desenvolvimento, entre outras. Os alunos aprendem a identificar a abordagem mais adequada para responder às suas perguntas de pesquisa e a projetar experimentos, protótipos ou modelos para testar suas hipóteses.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 19,
    "hashId": "e53e4c8c8b308ca8d51499906006350b",
    "name": "Sistemas Operacionais",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://c4.wallpaperflare.com/wallpaper/721/581/196/android-operating-system-wallpaper-preview.jpg",
    "shortDescription": " A disciplina de Sistemas Operacionais é uma área de estudo fundamental na área da Ciência da Computação e Engenharia de Computação. ",
    "longDescription": " A disciplina de Sistemas Operacionais é uma área de estudo fundamental na área da Ciência da Computação e Engenharia de Computação. Ela se concentra no estudo dos princípios, conceitos e funcionalidades dos sistemas operacionais, que são softwares responsáveis por gerenciar os recursos e fornecer serviços essenciais para o funcionamento de um computador. A disciplina aborda uma ampla gama de tópicos relacionados aos sistemas operacionais, incluindo gerenciamento de processos, gerenciamento de memória, sistemas de arquivos, gerenciamento de dispositivos, comunicação entre processos, escalonamento de tarefas, segurança e proteção de dados, entre outros.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 20,
    "hashId": "284cdb1e4c3cf365a20755920b86dd65",
    "name": "Trabalho Interdisciplinar: Aplicações para Cenários Reais",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-ZBw2G1CN4lTMDGSifZ6iI38a7vdL3rpyj8B4kitCISredW_HNt8bDnwA-VxnRqeGK4o&usqp=CAU",
    "shortDescription": " A disciplina de Trabalho Interdisciplinar: Aplicações para Cenários Reais é uma abordagem inovadora de aprendizado que busca integrar conhecimentos e habilidades de diferentes disciplinas para resolver problemas complexos do mundo real. ",
    "longDescription": " A disciplina de Trabalho Interdisciplinar: Aplicações para Cenários Reais é uma abordagem inovadora de aprendizado que busca integrar conhecimentos e habilidades de diferentes disciplinas para resolver problemas complexos do mundo real. Ela tem como objetivo principal promover a colaboração e a interação entre estudantes de diferentes áreas do conhecimento, proporcionando uma experiência de aprendizado rica e diversificada. A disciplina de Trabalho Interdisciplinar enfatiza a importância da integração de conhecimentos teóricos e práticos, combinando os conceitos e abordagens de várias disciplinas acadêmicas. Por meio de projetos e estudos de caso, os alunos são desafiados a aplicar seus conhecimentos em situações reais, enfrentando desafios complexos e multifacetados. Um dos principais elementos dessa disciplina é a formação de equipes interdisciplinares. Os estudantes são agrupados em equipes compostas por membros de diferentes áreas, como Engenharia, Administração, Design, Psicologia, entre outras. Essa diversidade de perspectivas e conhecimentos permite que os alunos abordem os problemas de forma mais abrangente, incorporando diferentes pontos de vista e habilidades complementares.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 21,
    "hashId": "d50241f301379a0b92eafbec616a63be",
    "name": "Interação Humano Computador",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://www.colorado.edu/atlas/sites/default/files/styles/large/public/article-image/human-computer-interaction-hci-uhd-4k-wallpaper.jpg?itok=4HKs5bAS",
    "shortDescription": "A disciplina de Interação Humano-Computador (IHC) é uma área de estudo que investiga a interação entre seres humanos e sistemas computacionais, com o objetivo de projetar interfaces eficientes, intuitivas e satisfatórias para os usuários.  ",
    "longDescription": "A disciplina de Interação Humano-Computador (IHC) é uma área de estudo que investiga a interação entre seres humanos e sistemas computacionais, com o objetivo de projetar interfaces eficientes, intuitivas e satisfatórias para os usuários. Essa disciplina considera os aspectos cognitivos, emocionais e sociais da interação, buscando melhorar a usabilidade, a experiência do usuário e a eficácia dos sistemas computacionais. A IHC abrange uma variedade de tópicos e abordagens, incluindo design centrado no usuário, ergonomia, interação multimodal, acessibilidade, prototipação, avaliação de interfaces, entre outros. Ela se baseia em conhecimentos de disciplinas como Psicologia, Design, Ciência da Computação e Engenharia, a fim de compreender as necessidades, expectativas e comportamentos dos usuários e aplicar esse conhecimento no projeto de interfaces efetivas.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 22,
    "hashId": "a11b3316163d0f9e81b9558ce48c4eb3",
    "name": "Redes de Computadores",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://wallpapercave.com/wp/wp2044697.jpg",
    "shortDescription": "A disciplina de Redes de Computadores é uma área de estudo que abrange os fundamentos, os princípios e as tecnologias relacionadas à comunicação e interconexão de computadores em escala global.",
    "longDescription": "A disciplina de Redes de Computadores é uma área de estudo que abrange os fundamentos, os princípios e as tecnologias relacionadas à comunicação e interconexão de computadores em escala global. Ela visa fornecer aos estudantes o conhecimento necessário para projetar, implementar e gerenciar redes de computadores eficientes e confiáveis. A disciplina aborda uma ampla gama de tópicos relacionados às redes de computadores, incluindo modelos de referência, protocolos de comunicação, topologias de rede, arquiteturas de rede, segurança de rede, serviços de rede, administração de redes e tecnologias emergentes.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 23,
    "hashId": "aefad1fc6a3ec1d925f7ea41ea5c9db6",
    "name": "Trabalho Interdisciplinar: Aplicações para Sustentabilidade",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://img.freepik.com/fotos-premium/computacao-verde-csr-etica-de-ti-natureza-interacao-com-tecnologia-e-ecologicamente-correto-espaco-para-texto_505353-541.jpg",
    "shortDescription": "A disciplina de Trabalho Interdisciplinar: Aplicações para Sustentabilidade é uma área de estudo que busca integrar conhecimentos e habilidades de diferentes disciplinas para abordar desafios relacionados à sustentabilidade ambiental, social e econômica.",
    "longDescription": "A disciplina de Trabalho Interdisciplinar: Aplicações para Sustentabilidade é uma área de estudo que busca integrar conhecimentos e habilidades de diferentes disciplinas para abordar desafios relacionados à sustentabilidade ambiental, social e econômica. Essa disciplina tem como objetivo principal promover a conscientização e a prática de ações sustentáveis, considerando o equilíbrio entre as necessidades presentes e futuras da sociedade e do meio ambiente. A sustentabilidade é um conceito que envolve a busca por soluções que atendam às necessidades atuais sem comprometer a capacidade das gerações futuras de atenderem às suas próprias necessidades. A disciplina de Trabalho Interdisciplinar: Aplicações para Sustentabilidade explora esse conceito e a aplicação prática de princípios sustentáveis em diferentes contextos.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 24,
    "hashId": "130dc4b2ce02d133505afd716294bd12",
    "name": "Desenvolvimento de Aplicações Móveis e Distribuídas",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://cutewallpaper.org/23/mobile-technology-wallpaper/2134429696.jpg",
    "shortDescription": "A disciplina de Desenvolvimento de Aplicações Móveis e Distribuídas é voltada para o estudo e prática do desenvolvimento de aplicativos para dispositivos móveis e sistemas distribuídos.",
    "longDescription": "A disciplina de Desenvolvimento de Aplicações Móveis e Distribuídas é voltada para o estudo e prática do desenvolvimento de aplicativos para dispositivos móveis e sistemas distribuídos. Essa disciplina abrange conceitos, tecnologias e práticas relacionadas à criação de aplicativos que operam em ambientes móveis e se comunicam com outros dispositivos e serviços. O desenvolvimento de aplicações móveis envolve a criação de softwares que são executados em dispositivos móveis, como smartphones e tablets. Os alunos aprendem a utilizar frameworks e plataformas populares, como Android (para dispositivos Android) e iOS (para dispositivos Apple), para desenvolver aplicativos nativos que atendam às necessidades dos usuários móveis.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 25,
    "hashId": "5bcfbba3ae863e9aac48486add31246c",
    "name": "Estatística e Probabilidade",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://e0.pxfuel.com/wallpapers/736/902/desktop-wallpaper-businessman.jpg",
    "shortDescription": "A disciplina de Estatística e Probabilidade é uma área de estudo que lida com a coleta, organização, análise e interpretação de dados, bem como com o estudo das probabilidades e eventos aleatórios.",
    "longDescription": "A disciplina de Estatística e Probabilidade é uma área de estudo que lida com a coleta, organização, análise e interpretação de dados, bem como com o estudo das probabilidades e eventos aleatórios. Essa disciplina desempenha um papel fundamental na tomada de decisões baseadas em dados e na compreensão de fenômenos incertos. A estatística envolve a coleta e a organização de dados, seguidas de técnicas de análise para extrair informações relevantes. Os alunos aprendem a aplicar métodos estatísticos para resumir, descrever e visualizar conjuntos de dados, como média, mediana, moda, desvio padrão, gráficos e histogramas. Eles também aprendem sobre amostragem, inferência estatística e estimativa de parâmetros populacionais com base em amostras.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 26,
    "hashId": "70605479a063d5415d368a5586214a9a",
    "name": "Fundamentos de Projeto e Análise de Algoritmos",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://www.pewresearch.org/internet/wp-content/uploads/sites/9/2017/02/PI_2017.02.08_Algorithms_featured.png",
    "shortDescription": "A disciplina de Fundamentos de Projeto e Análise de Algoritmos é uma área de estudo que se concentra na análise teórica e prática dos algoritmos, com o objetivo de desenvolver habilidades de projeto eficiente e análise rigorosa de algoritmos para resolver problemas computacionais.",
    "longDescription": "A disciplina de Fundamentos de Projeto e Análise de Algoritmos é uma área de estudo que se concentra na análise teórica e prática dos algoritmos, com o objetivo de desenvolver habilidades de projeto eficiente e análise rigorosa de algoritmos para resolver problemas computacionais. Os algoritmos desempenham um papel fundamental na resolução de problemas em ciência da computação e em diversas áreas da tecnologia. Eles são conjuntos de instruções bem definidas que descrevem um processo passo a passo para resolver um determinado problema. A disciplina aborda os princípios básicos necessários para projetar algoritmos eficientes e analisar sua complexidade.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 27,
    "hashId": "28accaca32ee652537359b76e9bd3d4e",
    "name": "Gerência de Projetos",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://wallpaperaccess.com/full/4391662.jpg",
    "shortDescription": "A disciplina de Gerência de Projetos aborda os conceitos, princípios e técnicas necessários para o planejamento, execução e controle eficazes de projetos.",
    "longDescription": "A disciplina de Gerência de Projetos aborda os conceitos, princípios e técnicas necessários para o planejamento, execução e controle eficazes de projetos. Ela se concentra nas habilidades e práticas necessárias para liderar equipes, gerenciar recursos e alcançar os objetivos estabelecidos dentro de um contexto de projeto. A gerência de projetos desempenha um papel fundamental em diversos setores, como tecnologia da informação, engenharia, construção, negócios e muitos outros, onde projetos são desenvolvidos para alcançar metas específicas dentro de prazos e recursos determinados.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 28,
    "hashId": "2dceb485c10a7871108c9180c3220c58",
    "name": "Laboratório de Desenvolvimento de Aplicações Móveis e Distribuídas",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://technolobe.com/wp-content/uploads/2020/01/top-5-wallpaper-apps-for-android-phones.jpg",
    "shortDescription": "A disciplina de Laboratório de Desenvolvimento de Aplicações Móveis e Distribuídas tem como objetivo fornecer aos alunos as habilidades práticas necessárias para projetar, desenvolver e testar aplicações móveis e distribuídas.",
    "longDescription": "A disciplina de Laboratório de Desenvolvimento de Aplicações Móveis e Distribuídas tem como objetivo fornecer aos alunos as habilidades práticas necessárias para projetar, desenvolver e testar aplicações móveis e distribuídas. Nessa disciplina, os alunos têm a oportunidade de trabalhar em projetos práticos, aplicando os conceitos e técnicas aprendidas em sala de aula para criar soluções funcionais e inovadoras. Durante o curso, os alunos são introduzidos às principais plataformas e tecnologias de desenvolvimento de aplicações móveis, como Android e iOS. Eles aprendem a utilizar as ferramentas de desenvolvimento apropriadas, como ambientes de desenvolvimento integrado (IDEs), kits de desenvolvimento de software (SDKs) e emuladores, para criar aplicações que sejam executadas em dispositivos móveis.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 29,
    "hashId": "17da1ae431f965d839ec8eb93087fb2b",
    "name": "Trabalho interdisciplinar: Apliações Móveis e Distribuídas",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://cubux.net/wp-content/uploads/2019/08/apps-mobile-smartphone-ss-1920-1000x500.jpg",
    "shortDescription": "A disciplina de Trabalho Interdisciplinar: Aplicações Móveis e Distribuídas é uma disciplina que busca integrar conhecimentos e habilidades de diferentes áreas para desenvolver soluções inovadoras e funcionais no contexto de aplicações móveis e distribuídas.",
    "longDescription": "A disciplina de Trabalho Interdisciplinar: Aplicações Móveis e Distribuídas é uma disciplina que busca integrar conhecimentos e habilidades de diferentes áreas para desenvolver soluções inovadoras e funcionais no contexto de aplicações móveis e distribuídas. Nessa disciplina, os alunos têm a oportunidade de trabalhar em equipes multidisciplinares, onde são incentivados a combinar conhecimentos de programação, design de interface, gerenciamento de projetos e outras disciplinas relevantes para criar aplicações móveis e distribuídas que atendam a necessidades específicas.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 30,
    "hashId": "1de08bf2f56c19b3cc586b3879e32145",
    "name": "Engenharia Econômica para Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://wallpaperaccess.com/full/1667635.jpg",
    "shortDescription": "A disciplina de Engenharia Econômica para Software tem como objetivo fornecer aos alunos os conhecimentos e habilidades necessários para avaliar e tomar decisões econômicas relacionadas a projetos de desenvolvimento de software.",
    "longDescription": "A disciplina de Engenharia Econômica para Software tem como objetivo fornecer aos alunos os conhecimentos e habilidades necessários para avaliar e tomar decisões econômicas relacionadas a projetos de desenvolvimento de software. Ela se baseia nos princípios da engenharia econômica, adaptados especificamente para o contexto da indústria de software. Durante o curso, os alunos são apresentados aos conceitos fundamentais da engenharia econômica, como valor do dinheiro no tempo, taxa de desconto, análise de custo-benefício e avaliação de investimentos. ",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 31,
    "hashId": "eeb806bafce1f696a1daa897736304a6",
    "name": "Gerência de Configuração e Evolução de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://wallpaperaccess.com/full/1385386.jpg",
    "shortDescription": "A disciplina de Gerência de Configuração e Evolução de Software tem como objetivo fornecer aos alunos os conhecimentos e habilidades necessários para gerenciar efetivamente a configuração e evolução do software ao longo do seu ciclo de vida.",
    "longDescription": "A disciplina de Gerência de Configuração e Evolução de Software tem como objetivo fornecer aos alunos os conhecimentos e habilidades necessários para gerenciar efetivamente a configuração e evolução do software ao longo do seu ciclo de vida. Ela aborda os processos, técnicas e ferramentas utilizados para controlar e coordenar as mudanças realizadas em um sistema de software, garantindo a integridade e a qualidade do produto final. ",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 32,
    "hashId": "46e920bd267fe619cde1c06b6b361248",
    "name": "Laboratório de Experimentação de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://www.testmonitor.com/hubfs/TestMonitor%20Blog%2048.png",
    "shortDescription": "Laboratório de Experimentação de Software é uma disciplina que faz parte dos cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins.",
    "longDescription": " Laboratório de Experimentação de Software é uma disciplina que faz parte dos cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins. Essa disciplina tem como objetivo fornecer aos estudantes uma experiência prática na execução de experimentos relacionados ao desenvolvimento de software. O Laboratório de Experimentação de Software visa fornecer uma abordagem científica para a análise e avaliação de técnicas, metodologias, ferramentas e práticas utilizadas no desenvolvimento de software.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 33,
    "hashId": "3d7cc4972edcf0486789f90e2a0bd715",
    "name": "Medição e Experimentação em Engenharia de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://uploads-ssl.webflow.com/5ed57622ee14fb96d022d544/5f503464b812794aee30db07_markus-winkler-IrRbSND5EUc-unsplash.jpg",
    "shortDescription": "A disciplina de Medição e Experimentação em Engenharia de Software é uma área de estudo que se concentra na aplicação de técnicas quantitativas e qualitativas para coletar dados, analisar e tirar conclusões sobre o desenvolvimento de software",
    "longDescription": " A disciplina de Medição e Experimentação em Engenharia de Software é uma área de estudo que se concentra na aplicação de técnicas quantitativas e qualitativas para coletar dados, analisar e tirar conclusões sobre o desenvolvimento de software. Ela tem como objetivo principal fornecer aos estudantes ferramentas e métodos para avaliar e aprimorar a qualidade dos processos e produtos de software. A disciplina de Medição e Experimentação em Engenharia de Software abrange uma variedade de tópicos relacionados à medição e experimentação. Os estudantes aprendem a definir métricas adequadas para avaliar diferentes aspectos do desenvolvimento de software, como desempenho, qualidade, manutenibilidade, usabilidade, entre outros.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 34,
    "hashId": "10eaba2d49a7040c7fc0154a611dd86e",
    "name": "Trabalho Interdisciplinar: Pesquisa em Engenharia de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSySwROAz6XrV8-huNMmrlzSF-q1CAMQr3eFw&usqp=CAU",
    "shortDescription": "A disciplina de Trabalho Interdisciplinar: Pesquisa em Engenharia de Software é uma disciplina que visa proporcionar aos estudantes a oportunidade de desenvolver habilidades de pesquisa e explorar tópicos avançados em engenharia de software",
    "longDescription": " A disciplina de Trabalho Interdisciplinar: Pesquisa em Engenharia de Software é uma disciplina que visa proporcionar aos estudantes a oportunidade de desenvolver habilidades de pesquisa e explorar tópicos avançados em engenharia de software. Essa disciplina geralmente é oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas relacionadas. O objetivo principal da disciplina de Trabalho Interdisciplinar: Pesquisa em Engenharia de Software é incentivar os estudantes a se envolverem em atividades de pesquisa e investigação na área de engenharia de software.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 35,
    "hashId": "0ea9eaf7c09fee7677a07ea7202ebb49",
    "name": "Computadores e Sociedade",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
    "shortDescription": "A disciplina de Computadores e Sociedade é uma área de estudo que explora a interação entre a tecnologia da computação e os aspectos sociais, éticos, legais e políticos da sociedade",
    "longDescription": "A disciplina de Computadores e Sociedade é uma área de estudo que explora a interação entre a tecnologia da computação e os aspectos sociais, éticos, legais e políticos da sociedade. Essa disciplina é comumente oferecida em cursos de ciência da computação, engenharia de software, tecnologia da informação e áreas relacionadas. O objetivo principal da disciplina de Computadores e Sociedade é fornecer aos estudantes uma compreensão abrangente dos impactos da tecnologia da computação na sociedade. Ela aborda questões fundamentais relacionadas ao uso e desenvolvimento de computadores, levando em consideração fatores sociais, culturais, econômicos e políticos.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 36,
    "hashId": "6db34a859f01e654b2c9897c76ef0877",
    "name": "Engenharia de Processos e Qualidade de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://www.apexon.com/wp-content/uploads/2021/06/Software-Quality-Metrics-Matter-Blog-Img-735x300.jpg\n",
    "shortDescription": "A disciplina de Engenharia de Processos e Qualidade de Software é uma área de estudo que se concentra na definição, implementação, melhoria e garantia da qualidade dos processos de desenvolvimento de software.",
    "longDescription": "A disciplina de Engenharia de Processos e Qualidade de Software é uma área de estudo que se concentra na definição, implementação, melhoria e garantia da qualidade dos processos de desenvolvimento de software. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em engenharia de software, ciência da computação e áreas relacionadas. O objetivo principal da disciplina de Engenharia de Processos e Qualidade de Software é fornecer aos estudantes os conhecimentos e as habilidades necessárias para desenvolver e gerenciar processos eficientes e de alta qualidade no desenvolvimento de software.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 37,
    "hashId": "e8a01d03688d99448f2dfc9bba4c2f04",
    "name": "Filosofia: Antropologia e Ética",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://c4.wallpaperflare.com/wallpaper/346/798/342/philosophy-artwork-painting-jacques-louis-david-wallpaper-preview.jpg",
    "shortDescription": "A disciplina de Filosofia: Antropologia e Ética é uma área de estudo que explora questões fundamentais sobre a natureza humana, a ética e os valores morais. Essa disciplina é comumente oferecida em cursos de filosofia, ciências humanas e áreas relacionadas.",
    "longDescription": "A disciplina de Filosofia: Antropologia e Ética é uma área de estudo que explora questões fundamentais sobre a natureza humana, a ética e os valores morais. Essa disciplina é comumente oferecida em cursos de filosofia, ciências humanas e áreas relacionadas. O objetivo principal da disciplina de Filosofia: Antropologia e Ética é fornecer aos estudantes uma compreensão profunda das questões filosóficas relacionadas à natureza humana, à conduta ética e aos valores morais. A disciplina abrange duas áreas principais: antropologia filosófica, que estuda a natureza e a essência do ser humano, e ética, que investiga os princípios morais e a tomada de decisões éticas.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 38,
    "hashId": "9951cb75d051954192398d726b90e97a",
    "name": "Gestão da Produção de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://png.pngtree.com/thumb_back/fh260/background/20220427/pngtree-business-analysis-and-communication-contemporary-marketing-and-software-for-development-image_1090680.jpg",
    "shortDescription": "A disciplina de Gestão da Produção de Software é uma área de estudo que se concentra na aplicação de princípios de gestão e técnicas de organização na produção de software. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em engenharia de software, ciência da computação e áreas relacionadas.",
    "longDescription": "A disciplina de Gestão da Produção de Software é uma área de estudo que se concentra na aplicação de princípios de gestão e técnicas de organização na produção de software. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em engenharia de software, ciência da computação e áreas relacionadas. O objetivo principal da disciplina de Gestão da Produção de Software é fornecer aos estudantes os conhecimentos e habilidades necessárias para planejar, organizar, controlar e otimizar a produção de software em um ambiente de projeto. Isso envolve a compreensão de princípios de gestão, estratégias de planejamento, técnicas de controle e melhoria contínua dos processos de desenvolvimento de software.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 39,
    "hashId": "f99e9dfd42750cb7fb4329e809047903",
    "name": "Tecnologias da Informação e do Conhecimento",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://learn.g2.com/hubfs/What_is_Information_Technology.jpg",
    "shortDescription": "A disciplina de Tecnologias da Informação e do Conhecimento é uma área de estudo que abrange o uso, aplicação e gerenciamento de tecnologias relacionadas à informação e ao conhecimento.",
    "longDescription": "A disciplina de Tecnologias da Informação e do Conhecimento é uma área de estudo que abrange o uso, aplicação e gerenciamento de tecnologias relacionadas à informação e ao conhecimento. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em áreas como ciência da computação, engenharia de software, sistemas de informação e áreas relacionadas. O objetivo principal da disciplina de Tecnologias da Informação e do Conhecimento é fornecer aos estudantes uma compreensão abrangente das diferentes tecnologias disponíveis para a coleta, armazenamento, processamento, análise e distribuição de informações e conhecimento.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 40,
    "hashId": "63e09040e66b1f51fd0a48434030146b",
    "name": "Tópicos em Computação I",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://images.unsplash.com/photo-1518770660439-4636190af475?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8aGFyZHdhcmV8ZW58MHx8MHx8fDA%3D&w=1000&q=80",
    "shortDescription": "A disciplina de Tópicos em Computação é uma área de estudo que abrange assuntos avançados e emergentes relacionados à ciência da computação e às tecnologias da informação",
    "longDescription": "A disciplina de Tópicos em Computação é uma área de estudo que abrange assuntos avançados e emergentes relacionados à ciência da computação e às tecnologias da informação. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins. O objetivo principal da disciplina de Tópicos em Computação é fornecer aos estudantes a oportunidade de explorar e aprofundar temas específicos e atualizados dentro da área de computação. Esses tópicos podem variar amplamente, refletindo os avanços rápidos e as tendências emergentes na área da tecnologia.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 41,
    "hashId": "3376d86c9731fa980766e7ada3d5badb",
    "name": "Tópicos em Computação II",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://cdn.wallpapersafari.com/89/22/8kBpIZ.jpg",
    "shortDescription": "A disciplina de Tópicos em Computação é uma área de estudo que abrange assuntos avançados e emergentes relacionados à ciência da computação e às tecnologias da informação",
    "longDescription": "A disciplina de Tópicos em Computação é uma área de estudo que abrange assuntos avançados e emergentes relacionados à ciência da computação e às tecnologias da informação. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins. O objetivo principal da disciplina de Tópicos em Computação é fornecer aos estudantes a oportunidade de explorar e aprofundar temas específicos e atualizados dentro da área de computação. Esses tópicos podem variar amplamente, refletindo os avanços rápidos e as tendências emergentes na área da tecnologia.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 42,
    "hashId": "e80fb1999ba5fc673c258852615fe90b",
    "name": "Trabalho de Conclusão de Curso I",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://st4.depositphotos.com/3122905/20915/i/450/depositphotos_209155348-stock-photo-summertime-fun-man-cooking-meat.jpg",
    "shortDescription": "A disciplina de Trabalho de Conclusão de Curso 1, também conhecida como TCC 1, é uma etapa fundamental na trajetória acadêmica de estudantes de graduação.",
    "longDescription": "A disciplina de Trabalho de Conclusão de Curso 1, também conhecida como TCC 1, é uma etapa fundamental na trajetória acadêmica de estudantes de graduação. Essa disciplina é comumente oferecida nos últimos períodos dos cursos de graduação e tem como objetivo orientar os estudantes na elaboração e desenvolvimento de um projeto de pesquisa ou trabalho prático que culminará na conclusão do curso. O principal propósito da disciplina de TCC 1 é permitir que os estudantes apliquem e aprofundem os conhecimentos adquiridos ao longo do curso, desenvolvendo um trabalho de cunho científico, tecnológico ou prático que explore uma questão relevante dentro da área de estudo. ",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 43,
    "hashId": "4e0307a4610cfb073ed5e914b384020b",
    "name": "Modelagem e Avaliação de Desempenho",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmUIC3rDBMmidiI28Xlpmr-6Efn_G9tRN-Yg&usqp=CAU",
    "shortDescription": "A disciplina de Modelagem e Avaliação de Desempenho é uma área de estudo que se concentra em técnicas e métodos para a modelagem, análise e avaliação do desempenho de sistemas computacionais.",
    "longDescription": "A disciplina de Modelagem e Avaliação de Desempenho é uma área de estudo que se concentra em técnicas e métodos para a modelagem, análise e avaliação do desempenho de sistemas computacionais. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins. O objetivo principal da disciplina de Modelagem e Avaliação de Desempenho é fornecer aos estudantes os conhecimentos e habilidades necessários para compreender, quantificar e otimizar o desempenho de sistemas computacionais, como redes de computadores, sistemas distribuídos, sistemas de bancos de dados, sistemas operacionais e aplicações web.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 44,
    "hashId": "d8b9e6f0ff68d633596d23cf5316584e",
    "name": "Segurança e Auditoria de Sistemas",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://img.freepik.com/premium-photo/wallpaper-illustration-background-cyber-security-data-protection-shield-with-key-lock-security-system-technology-digital-front-view-concept-database-security-software-generative-ai_438099-13482.jpg?w=2000",
    "shortDescription": "A disciplina de Segurança e Auditoria de Sistemas é uma área de estudo que abrange técnicas, metodologias e práticas relacionadas à proteção, detecção e resposta a ameaças de segurança em sistemas de informação.",
    "longDescription": "A disciplina de Segurança e Auditoria de Sistemas é uma área de estudo que abrange técnicas, metodologias e práticas relacionadas à proteção, detecção e resposta a ameaças de segurança em sistemas de informação. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software, sistemas de informação e áreas afins. O objetivo principal da disciplina de Segurança e Auditoria de Sistemas é fornecer aos estudantes uma compreensão abrangente dos princípios de segurança da informação, riscos de segurança, técnicas de proteção e ferramentas de auditoria.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 45,
    "hashId": "07e5374cc24d1d46376c396e9c1e2123",
    "name": "Tópicos em Engenharia de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://e0.pxfuel.com/wallpapers/287/715/desktop-wallpaper-software-engineering-software-development.jpg",
    "shortDescription": "A disciplina de Tópicos em Engenharia de Software é uma área de estudo que aborda temas avançados e emergentes relacionados à Engenharia de Software. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins.",
    "longDescription": "A disciplina de Tópicos em Engenharia de Software é uma área de estudo que aborda temas avançados e emergentes relacionados à Engenharia de Software. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins. O objetivo principal da disciplina de Tópicos em Engenharia de Software é fornecer aos estudantes a oportunidade de explorar e aprofundar tópicos específicos dentro do campo da Engenharia de Software que estão além do escopo das disciplinas tradicionais do currículo.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },

  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 46,
    "hashId": "08f28c273a33af221ac42770ea2aa1c2",
    "name": "Tópicos em Sistemas de Software",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://p2.trrsf.com/image/fget/cf/1200/630/middle/images.terra.com/2022/08/12/empresas-precisam-se-livrar-de-software-obsoleto-vbbuefv55a2g.jpg",
    "shortDescription": "A disciplina de Tópicos em Sistemas de Software é uma área de estudo que aborda temas avançados e emergentes relacionados ao desenvolvimento, design, arquitetura e gerenciamento de sistemas de software. ",
    "longDescription": "A disciplina de Tópicos em Sistemas de Software é uma área de estudo que aborda temas avançados e emergentes relacionados ao desenvolvimento, design, arquitetura e gerenciamento de sistemas de software. Essa disciplina é comumente oferecida em cursos de graduação e pós-graduação em ciência da computação, engenharia de software e áreas afins. O objetivo principal da disciplina de Tópicos em Sistemas de Software é fornecer aos estudantes a oportunidade de explorar e aprofundar tópicos específicos dentro do campo dos sistemas de software que estão além do escopo das disciplinas tradicionais do currículo.",
    "course": {
      "id": 1
    },
    "reviews":[]
  },
  {
    "_class": "com.ti.avaliai.subject.Subject",
    "id": 47,
    "hashId": "2fb9b318cb97a5926a75f1b23560ba2a",
    "name": "Trabalho de Conclusão de Curso II",
    "campus": "Praça da Liberdade",
    "imageUrl": "https://cdn.wallpapersafari.com/64/60/kQ71jM.jpg",
    "shortDescription": "A disciplina de Trabalho de Conclusão de Curso 2, também conhecida como TCC 2, é uma etapa fundamental na trajetória acadêmica de estudantes de graduação.",
    "longDescription": "A disciplina de Trabalho de Conclusão de Curso 2, também conhecida como TCC 2, é uma etapa fundamental na trajetória acadêmica de estudantes de graduação. Essa disciplina é comumente oferecida nos últimos períodos dos cursos de graduação e tem como objetivo orientar os estudantes na elaboração e desenvolvimento de um projeto de pesquisa ou trabalho prático que culminará na conclusão do curso. O principal propósito da disciplina de TCC 2 é permitir que os estudantes apliquem e aprofundem os conhecimentos adquiridos ao longo do curso, desenvolvendo um trabalho de cunho científico, tecnológico ou prático que explore uma questão relevante dentro da área de estudo. ",
    "course": {
      "id": 1
    },
    "reviews":[]
  }
]
